Revit 2027 API
PartMaker.IsSourceElement Method
 Is the element a source for this PartMaker
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSourceElement(
	ElementId elemId
)
Public Function IsSourceElement (
	elemId As ElementId
) As Boolean
public:
bool IsSourceElement(
	ElementId^ elemId
)
member IsSourceElement :
        elemId : ElementId -> bool
Parameters
elemId ElementId
Return Value
Boolean
 Returns true if elemId is among the source elements of this PartMaker
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMaker Class
Autodesk.Revit.DB Namespace